Sample_app/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)    # Not the final implementation!
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "JEONG NAMJIN"], ["password_digest", "$2a$10$OZF8cBFLYaW.6C0bF/ZoyuXyvOtqpIqXuuq6DJYMQ9XotiegIV6mO"], ["updated_at", "2019-07-15 14:59:57.808551"], ["id", 1]]